#pragma once

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
#include "ViewProjection.h"
#include "WorldTransform.h"
#include "Input.h"

////////////////////////////////////////////////////////////////////////////////////////////
// FollowCamera class
////////////////////////////////////////////////////////////////////////////////////////////
class FollowCamera {
public:

	//=========================================================================================
	// public methods
	//=========================================================================================

	void Init();

	void Update();

	void SetTarget(const WorldTransform* target) { target_ = target; }

	const ViewProjection& GetViewProjection() const { return viewProj_; }

private:

	//=========================================================================================
	// private variables
	//=========================================================================================

	// デバック用input
	Input* input_ = Input::GetInstance();

	// 追従対象
	const WorldTransform* target_ = nullptr;

	//* menber *//

	ViewProjection viewProj_;

	/* parameter */

	const Vector3f kOffset_ = {0.0f, 2.0f, -10.0f};
	const float kRotSpeed_ = 0.04f;

	//=========================================================================================
	// private methods
	//=========================================================================================

	void Rotate();

};