#pragma once

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
// collider
#include "Collider.h"

// c++
#include <list>
#include <memory>

// engine
#include "Model.h"

////////////////////////////////////////////////////////////////////////////////////////////
// CollisionManager class
////////////////////////////////////////////////////////////////////////////////////////////
class CollisionManager {
public:

	//=========================================================================================
	// public methods
	//=========================================================================================

	void Init();

	void Draw(const ViewProjection& viewProj);

	void Reset();

	void UpdateWorldTransform();

	void CheckAllCollisions();

	void AddCollider(Collider* collider);

private:

	//=========================================================================================
	// private variables
	//=========================================================================================

	std::list<Collider*> colliders_;

	// debug用モデル
	std::unique_ptr<Model> debugModel_;

	//* member *//
	bool isDisplay_ = true;

	//=========================================================================================
	// private methods
	//=========================================================================================

	void CheckCollisionPair(Collider* a, Collider* b);

};